[
{"url": "https://apnews.com/article/health-business-medicare-government-and-politics-1b77c8584602a1abaaa3dfd297f0dbe7?utm_source=homepage&utm_medium=TopNews&utm_campaign=position_02", "source": "Associated Press", "title": "Medicare enrollees warned about deceptive marketing schemes", "description": "WASHINGTON (AP) — Mailers designed to look like official government forms. Buses sporting scam pitches for Medicare websites. TV commercials featuring celebrities who encourage people to sign up for Medicare plans that do not always include their current doctors. ", "date": "2022-11-05T04:10:24Z", "author": "Amanda Seitz", "text": ["WASHINGTON (AP) — Mailers designed to look like official government forms. Buses sporting scam pitches for Medicare websites. TV commercials featuring celebrities who encourage people to sign up for Medicare plans that do not always include their current doctors.", "With Medicare’s open enrollment underway through Dec. 7, health experts are warning older adults about an uptick in misleading marketing tactics that might lead some to sign up for Medicare Advantage plans that do not cover their regular doctors or prescriptions and drive up out-of-pocket costs. ", "“It’s a very complicated environment where people are receiving information from companies that are also selling them plans,” said Gretchen Jacobson at the Commonwealth Fund, a health care think tank. “It’s important we find a way to protect and inform consumers.”", "Business is booming in the ", ". Competition for customers is fierce, with insurers turning to marketing agencies and brokers in an effort to help stick out among dozens of plans offered through the program.", "Staff at the Centers for Medicare and Medicaid are on the trail. They are secretly shopping for plans by calling the numbers linked to some online, TV and newspaper ads placed by these marketing firms, according to an agency memo sent to insurers last month. Already, the operation has turned up insurance agents who were using inaccurate information to sell plans. In some cases, ads or agents have overstated the benefits that enrollees would get and the money they would save in the new plans. ", "The government agency can issue warning letters and, in some cases, small civil fines for violations. ", "“CMS is concerned about the marketing practices of all entities, including Third-Party Marketing organizations,” Kathryn A. Coleman, director of the agency’s Medicare Drug and Health Plan Contract Administration Group, wrote in the letter. ", "The agency reported a spike in complaints last year around misleading Medicare Advantage ads, receiving nearly 40,000 compared to 15,000 in 2020. Data is not yet available for this year. ", "Democrats on the Senate Finance Committee ", " showing that several states also reported an increase in complaints around deceptive marketing schemes in 2021. ", "In Ohio, for example, older adults received mailers resembling federal government tax forms that featured promises of bigger Social Security checks if they enrolled in a new Medicare Advantage plan. State officials also reported that a bus was designed to look like an official Medicare bus, but displayed an advertising a link to an insurance broker. ", "Nationwide TV ads, too, have misled some customers, the committee’s report found. ", "One ad, featuring a former NFL football player, failed to tell viewers that plans vary by ZIP code or that some providers will not be in network — meaning higher out-of-pocket costs for consumers — while promising to “add money back to your Social Security check.” ", "The committee surveyed 15 states about complaints about Medicare Advantage marketing, finding that 9 of 10 states that tracked such complaints saw an increase in reports from 2020 to 2021. ", "“It is unacceptable for this magnitude of fraudsters and scam artists to be running amok in Medicare and I will be working closely with CMS to ensure this dramatic increase in marketing complaints is addressed,” said the committee chairman, Sen. Ron Wyden, D-Ore.", "In the memo last month, the government agency said it had reviewed thousands of complaints, finding “numerous issues.” It is also requiring that insurance agents and brokers record enrollment calls with clients so they can be reviewed if complaints are lodged. CMS said insurance companies are responsible for the material published on their behalf by agents, brokers or marketing companies they contract with. ", "In Georgia, state officials are tracking an increase in marketing around the plans and say they are fielding more calls from people who are worried about the plans they enrolled in, said Christine Williams of the State Health Insurance Assistance Program. In some cases, callers have said they enrolled in a plan that didn’t allow them to see their providers. ", "She said people who are enrolling in Medicare Advantage should ask brokers or agents how doctors, prescriptions and services, including dental or vision care, are covered by the plans they are selling. Every state also offers counselors to help people navigate the enrollment process. ", "“Really ask specific questions,” Williams said. "]},
{"url": "https://apnews.com/article/brooklyn-nets-nba-sports-kyrie-irving-racial-injustice-972e41eed3debbd9a548433c78227f05?utm_source=homepage&utm_medium=TopNews&utm_campaign=position_07", "source": "Associated Press", "title": "Nike splits with Kyrie Irving amid antisemitism fallout", "description": "Nike has suspended its relationship with Kyrie Irving and canceled its plans to release his next signature shoe, the latest chapter in the ongoing fallout since the Brooklyn Nets guard tweeted a link to a film containing antisemitic material. ", "date": "2022-11-05T01:16:35Z", "author": "Tim Reynolds", "text": ["Nike has suspended its relationship with Kyrie Irving and canceled its plans to release his next signature shoe, the latest chapter in the ongoing fallout since the Brooklyn Nets guard tweeted a link to a film containing antisemitic material.", "The shoe giant announced Friday night that it will halt its relationship with Irving, who has been suspended by the Nets for what the team called a repeated failure to “unequivocally say he has no antisemitic beliefs.”", "The Nets made that move Thursday, ", " and a day later, Nike made its decision. Those actions followed widespread criticism — from, among many others, the Anti-Defamation League and NBA Commissioner Adam Silver.", "“At Nike, we believe there is no place for hate speech and we condemn any form of antisemitism,” the Beaverton, Oregon-based company said. “To that end, we’ve made the decision to suspend our relationship with Kyrie Irving effective immediately and will no longer launch the Kyrie 8.”", "Irving has had a signature line with Nike since 2014.", "“We are deeply saddened and disappointed by the situation and its impact on everyone,” Nike said.", "Irving signed with Nike in 2011, shortly after becoming the No. 1 pick in that year’s NBA draft. Irving’s first signature shoe was released three years later, and the popularity of the Kyrie line led to him making a reported $11 million annually just from the Nike endorsement.", "The Kyrie 8 was expected to be released in the next week. Previous models of his shoes were still for sale on the Nike website Friday night.", "Irving posted a tweet — which has since been deleted — last week with a link to the documentary “Hebrews to Negroes: Wake Up Black America,” which includes Holocaust denial and conspiracy theories about Jews. In a contentious postgame interview session last Saturday, Irving defended his right to post what he wants.", "The fallout only continued from there. The NBA put out a statement over the weekend that didn’t name Irving but denounced all forms of hate speech. ", " occupied some courtside seats at the Brooklyn-Indiana game on Monday night, a day after he took down the tweet. The Nets and coach Steve Nash parted ways Tuesday, a development that has been overshadowed by the Irving saga.", "On Wednesday, Irving said he opposes all forms of hate, and he and the Nets each announced that they would each donate $500,000 toward groups that work to eradicate it. Silver then issued a new statement calling on Irving by name to apologize, and Irving refused to give a direct answer when asked Thursday if he has antisemitic beliefs.", "That, evidently, was the last straw for the Nets, who suspended him. Hours later, ", " for not explaining the specific beliefs he agreed and disagreed with when he posted the documentary.", "“To All Jewish families and Communities that are hurt and affected from my post, I am deeply sorry to have caused you pain, and I apologize,” Irving wrote. “I initially reacted out of emotion to being unjustly labeled Anti-Semitic, instead of focusing on the healing process of my Jewish Brothers and Sisters that were hurt from the hateful remarks made in the Documentary.”", "A day later, Nike — which had also been criticized for not moving more swiftly — took action.", "Irving becomes the second celebrity in less than two weeks to lose a major shoe deal over antisemitism. ", " a move the German company said would result in about $250 million in losses this year after stopping production of its line of Yeezy products as well as halting payments to Ye and his companies.", "For weeks, Ye made antisemitic comments in interviews and on social media, including a Twitter post that he would soon go “death con 3 on JEWISH PEOPLE,” an apparent reference to the U.S. defense readiness condition scale known as DEFCON.", "Irving has expressed no shortage of controversial opinions during his career. He repeatedly questioned whether the Earth was round before eventually ", ". Last year, his refusal to get a COVID-19 vaccine led to him being banned from playing in most of the Nets’ home games.", "The Nets played at Washington on Friday, winning 128-86 without Irving. The 42-point win matched the fourth-largest in Nets franchise history.", " that Irving’s apology was a step forward, but many other steps will be required before he can resume playing.", "“There is going to be some remedial steps and measures that have been put in place for him to obviously seek some counseling ... from dealing with some anti-hate and some Jewish leaders within our community,” Marks said. “He’s going to have to sit down with them, he’s going to have to sit down with the organization after this, and we’ll evaluate and see if this is the right opportunity to bring him back.”", "___", "AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"]},
{"url": "https://apnews.com/article/rihanna-fashion-forests-brazil-fish-c1977ecc91fb059dc941e4d4660f6e6a?utm_source=homepage&utm_medium=TopNews&utm_campaign=position_09", "source": "Associated Press", "title": "Giant, sustainable rainforest fish is now fashion in America", "description": "TRES RIOS, Brazil (AP) — Sometimes you start something and have no idea where it will lead. So it was with Eduardo Filgueiras, a struggling guitarist whose family worked in an unusual business in Rio de Janeiro: They farmed toads. ", "date": "2022-11-04T12:18:42Z", "author": "Fabiano Maisonnave", "text": []},
{"url": "https://apnews.com/article/elon-musk-twitter-inc-business-layoffs-c0334da78b3af9faf2f43cf3f6e52ffa?utm_source=homepage&utm_medium=TopNews&utm_campaign=position_08", "source": "Associated Press", "title": "Twitter slashes its staff as Musk era takes hold on platform", "description": "Twitter began widespread layoffs Friday as new owner Elon Musk overhauls the company,  raising grave concerns about chaos enveloping the social media platform and its ability to fight disinformation just days ahead of the U.S. ", "date": "2022-11-04T11:33:17Z", "author": "Barbara Ortutay", "text": ["Twitter began widespread layoffs Friday as new owner Elon Musk ", " raising grave concerns about chaos enveloping the social media platform and its ability to fight disinformation just days ahead of the U.S. midterm elections.", "The speed and size of the cuts also opened Musk and Twitter to lawsuits. At least one was filed alleging Twitter violated federal law by not providing fired employees the required notice.", "The San Francisco-based company told workers by email Thursday that they would learn Friday if they had been laid off. About half of the company’s staff of 7,500 was let go, Yoel Roth, Twitter’s head of safety & integrity, confirmed in a tweet. ", "Musk tweeted late Friday that there was no choice but to cut the jobs “when the company is losing over $4M/day.” He did not provide details on the daily losses at the company and said employees who lost their jobs were offered three months’ pay as a severance. ", "No other social media platform comes close to Twitter as a place where public agencies and other vital service providers — election boards, police departments, utilities, schools and news outlets — keep people reliably informed. Many fear Musk’s layoffs will gut it and render it lawless.", "Roth said the company’s front-line moderation staff was the group the least impacted by the job cuts.", "He added that Twitter’s “efforts on election integrity — including harmful misinformation that can suppress the vote and combatting state-backed information operations — remain a top priority.”", "Musk, meanwhile, tweeted that “Twitter’s strong commitment to content moderation remains absolutely unchanged.”", "But a Twitter employee who spoke with The Associated Press Friday said it will be a lot harder to get that work done starting next week after losing so many colleagues.", "“This will impact our ability to provide support for elections, definitely,” said the employee who spoke on the condition of anonymity out of concerns for job security.", "The employee said there’s no “concrete sense of direction” except for what Musk says publicly on Twitter.", "“I follow his tweets and they affect how we prioritize our work,” said the employee. “It’s a very healthy indicator of what to prioritize.”", "Several employees who tweeted about losing their jobs said Twitter eliminated their entire teams, including one focused on human rights and global conflicts, another checking Twitter’s algorithms for bias in how tweets get amplified, and an engineering team devoted to making the social platform more accessible for people with disabilities.", "Eddie Perez, a Twitter civic integrity team manager who quit in September, said he fears the layoffs so close to the midterms could allow disinformation to “spread like wildfire” during the post-election vote-counting period in particular.", "“I have a hard time believing that it doesn’t have a material impact on their ability to manage the amount of disinformation out there,” he said, adding that there simply may not be enough employees to beat it back.", "President Joe Biden, at a campaign event in Illinois Friday night, said: “Now what are we all worried about? Elon Musk, who goes out and buys an outfit that sends and spews lies all across the world. ... How do we expect kids to be able to understand what is at stake?”", "Twitter’s employees have been expecting layoffs ", ". He ", ", and removed the company’s board of directors on his first day as owner. ", "As the emailed notices went out, many Twitter employees took to the platform to express support for each other — often simply tweeting blue heart emojis to signify its blue bird logo — and salute emojis in replies to each other.", "A Twitter manager said many employees found out they had been laid off when they could no longer log into the company’s systems. The manager said the way the layoffs were conducted showed a “lack of care and thoughtfulness.” The manager, who spoke to the AP on the condition of anonymity out of concerns for job security, said managers were not given any notice about who would be getting laid off.", "“For me as a manager, it’s been excruciating because I had to find out about what my team was going to look like through tweets and through texting and calling people,” the employee said. “That’s a really hard way to care for your people. And managers at Twitter care a lot about their people.”", "A coalition of civil rights groups escalated their calls Friday ", ". The layoffs are particularly dangerous ahead of the elections, the groups warned, and for transgender users and other groups facing violence inspired by hate speech that proliferates online.", "In a tweet Friday, Musk blamed activists for what he described as a “massive drop in revenue” since he took over Twitter late last week.", "Insider Intelligence analyst Jasmine Enberg said there is “little Musk can say to appease advertisers when he’s keeping the company in a constant state of uncertainty and turmoil, and appears indifferent to Twitter employees and the law.”", "“Musk needs advertisers more than they need him,” she said. “Pulling ads from Twitter is a quick and painless decision for most brands.”", "A lawsuit was filed Thursday in federal court in San Francisco on behalf of one employee who was laid off and three others who were locked out of their work accounts. It alleges Twitter violated the law by not providing the required notice. ", "The Worker Adjustment and Retraining Notification statute requires employers with at least 100 workers to disclose layoffs involving 500 or more employees, regardless of whether a company is publicly traded or privately held, as Twitter is now. ", "Twitter filed notifications late Friday in California for its offices in San Francisco, Los Angeles and San Jose. The layoffs affected 983 employees in the state, according to the filings. Twitter said it will continue to pay wages and benefits to the workers through Jan. 4 and employees were notified on Friday. ", "The layoffs affected Twitter’s offices around the world. In the United Kingdom, it would be required by law to give employees notice, said Emma Bartlett, a partner specializing in employment and partnership law at CM Murray LLP. ", "The speed of the layoffs could also open Musk and Twitter up to discrimination claims if it turns out, for instance, that they disproportionally affected women, people of color or older workers.", "___", "AP Business Writers Mae Anderson, Alexandra Olson and Ken Sweet in New York, James Pollard in Columbia, S.C., Frank Bajak in Boston and Danica Kirka in London contributed to this story."]},
{"url": "https://apnews.com/article/russia-ukraine-zelenskyy-kyiv-europe-terrorism-6eef75649441fa87c7c75f96c3937006?utm_source=homepage&utm_medium=TopNews&utm_campaign=position_06", "source": "Associated Press", "title": "Russian soldiers enter Kherson homes, dig in for urban war", "description": "KYIV, Ukraine (AP) — Russian soldiers are forcing Ukrainian civilians from their apartments in the occupied capital of the Kherson region and moving in themselves, a resident said Friday as the southern city became a growing focus of war in Ukraine. ", "date": "2022-11-04T10:38:34Z", "author": "Andrew Meldrum", "text": ["KYIV, Ukraine (AP) — Russian soldiers are forcing Ukrainian civilians from their apartments in the occupied capital of the Kherson region and moving in themselves, a resident said Friday as the southern city became a growing focus of war in Ukraine. ", "His account of soldiers spreading throughout the city of Kherson suggested that Russia could be preparing for intense urban warfare in anticipation of Ukrainian advances.", "Russia-installed authorities in Kherson continued to urge civilians to leave the city, which lies on the western bank of the Dnieper River and has been cut off from supplies and food by Ukrainian bombardment. ", "Kirill Stremousov, the deputy head of the region’s Kremlin-appointed administration, reiterated calls for civilians to depart for the other bank of the river. Stremousov said Thursday that Russian forces might soon withdraw from Kherson city. On Friday, he said the statement was merely an attempt to encourage evacuations.", "Ukrainian President Volodymyr Zelenskyy has suggested the Russians were feigning a pullout from Kherson in order to lure the Ukrainian army into an entrenched battle. Zelenskyy called attempts to convince civilians to move deeper into Russian-controlled territory “theater.”", "A Kherson resident told The Associated Press that Russian soldiers were installing themselves in vacated apartments. Russian military personnel were going door to door, checking property deeds and forcing tenants to leave immediately if they can’t prove ownership of apartments, he said.", "“They’re forcing city residents to evacuate, and then Russian soldiers move into freed-up apartments across all of Kherson,” the resident, who spoke on condition that only his first name — Konstantin — was used for security reasons. “It is obvious that they are preparing for fighting the Ukrainian army in the city.” ", "Hospitals and clinics were not serving patients in Kherson, where residents also reported problems with food supplies.", "“There are almost no deliveries of food into the city, the residents are using their own stocks and are queuing to the few shops that are still open,” Konstantin said.", "Ukrainian military analyst Oleh Zhdanov told the AP that as part of its counteroffensive to reclaim the Kherson region, the Ukrainian army cut off the western bank of the Dnieper from supplies of weapons and food by shelling main transportation routes and ruining bridges across the river.", "“The Russians understand the danger of transport routes being blocked and have practically put up with the fact that they will have to retreat from the right bank of the Dnieper,” Zhdanov said. “But the Russian troops are not prepared to leave Kherson peacefully and are preparing for battles within the city. They’re deploying the mobilized reservists there and new tactical battalion groups.”", "According to Zhdanov, the Ukrainian army has a significant advantage over the Russians in aviation and artillery on the right bank, which means that they could shell the city of Kherson and avoid a head-on clash.", "“Kyiv is taking its time because the Russian resources in Kherson are evaporating, and they’re getting weaker by the day, which allows the Ukrainians to accumulate forces for the main strike,” Zhdanov said.", "Russian forces seized Kherson city soon after invading Ukraine in late February. Russia illegally annexed the Kherson, Donetsk, Luhansk and Zaporizhzhia regions of Ukraine in late September and subsequently declared martial law in the four provinces. ", "The ", " regional administration in Kherson already has moved tens of thousands of civilians out of the city, citing the threat of increased shelling as Ukraine’s army pursues its counteroffensive. ", "Ukraine’s southern military spokeswoman, Natalia Humeniuk, told Ukrainian television that some Russian military personnel were disguising themselves as civilians.", "Neither side’s claims could be independently verified.", "Elsewhere, Ukrainian officials reported shooting down drones launched by Russian forces: eight drones in the Nikopol area, which was also subjected to shelling, and another drone over the western Lviv region.", "The commander of Ukraine’s armed forces, Valeriy Zaluzhny, said Russian forces had “tripled the intensity of hostilities on certain areas of the front” and were carrying out “up to 80 attacks every day.”", "Zelenskyy’s office said at least nine civilians were killed and 16 wounded by attacks in Ukraine in the last day. ", "In Moscow, Russian President Vladimir Putin claimed Friday that there was still a steady stream of volunteers wanting to join the Russian military, with 318,000 people already mobilized. Authorities previously said the goal was to mobilize some 300,000 reservists.", "Putin said 49,000 were already in the army on combat missions, while the rest were still being trained. Russian Defense Minister Sergei Shoigu said Tuesday that 87,000 were deployed to Ukraine. The discrepancy could not be reconciled.", "When Russia announced the mobilization drive in September, protests erupted in several regions and tens of thousands of Russians fled the country. ", "Putin also signed a law Friday permitting the military mobilization of those with expunged or outstanding convictions, including those who have recently served time for murder, robbery and drug trafficking. ", "On the Black Sea grain corridor, Russia agreed Wednesday to rejoin a wartime agreement brokered by the United Nations and Turkey allowing Ukrainian grain to be shipped to world markets through it. Moscow had suspended its participation in the grain deal over the weekend, citing an alleged drone attack against its Black Sea fleet in Crimea.", "The Ukrainian Armed Forces said “the functioning of grain corridors continues” Friday.", "As a condition for returning to the deal, Russia has demanded the grain be sent to poorer countries, arguing that most of it was ending up in richer nations. Turkish President Recep Tayyip Erdogan said Friday he had discussed the issue of prioritizing less developed countries for the grain shipments during a call with U.N. Secretary-General Antonio Guterres.", "Erdogan said he also discussed the possibility of sending the grain to nations facing famine for free, during a recent call with Putin, and the two planned further talks at a Group of 20 meeting in Bali this month.", "___", "Karmanau reported from Tallinn, Estonia. Suzan Fraser in Ankara, Turkey, contributed to this report.", "___", "Follow AP’s coverage of the war in Ukraine: "]},
{"url": "https://apnews.com/article/biden-inflation-economy-economic-growth-government-and-politics-ea50755f87fa765d038b16a2d0e4fc4c?utm_source=homepage&utm_medium=TopNews&utm_campaign=position_03", "source": "Associated Press", "title": "Biden stumps on job growth, as voters dread inflation", "description": "WASHINGTON (AP) — President Joe Biden has notched an envious record on jobs, with 10.3 million gained during his tenure. But voters in Tuesday's midterm elections are far more focused on inflation  hovering near 40-year highs . ", "date": "2022-11-05T04:14:18Z", "author": "Josh Boak", "text": ["WASHINGTON (AP) — President Joe Biden has notched an envious record on jobs, with 10.3 million gained during his tenure. But voters in Tuesday’s midterm elections are far more ", " hovering near ", ".", "That’s left the president trying to convince the public that the job gains mean better days are ahead, even as ", " build. ", "Presidents have long trusted that voters would reward them for strong economic growth, but inflation has thrown a monkey wrench into the already difficult probability of Democrats’ retaining control of the ", ". ", "Economic anxieties have compounded as the Federal Reserve has ", " its benchmark interest rates to lower inflation and possibly raise unemployment. Mortgage costs have shot upwards, while the S&P 500 stock index has dropped more than 20% so far this year as the world braces for a possible downturn.", "Biden is asking voters to look beyond the current financial pain, saying that what matters are the job gains that he believes his policies are fostering. The government reported Friday that employers added ", " as the unemployment rate bumped up to 3.7%. ", "Roughly 740,000 manufacturing jobs have been added since the start of Biden’s presidency, a figure that the president says will keep rising because of his funding for infrastructure projects, the production of computer chips and the switch to clean energy sources.", "“America is reasserting itself — it’s as simple as that,” Biden said in a Friday speech. “We also know folks are still struggling with inflation. It’s our number one priority.”", "Yet the president is also warning that a Republican majority in Congress could make inflation worse by seeking to undo his programs and treating payments on the federal debt as a bargaining chip instead of an obligation to honor. ", "His challenge is that the party in power generally faces skeptical voters in U.S. midterms and inflation looms over the public mindset more than job growth.", "“If you have a job, it’s small comfort to know that the job market is strong if at the same time you feel like every paycheck is worth less and less anyway,” said pollster Kristen Soltis Anderson. “Inflation is such political poison because voters are reminded every day whenever they spend money that it is a problem we are experiencing.”", "As Biden tries to fend off fears that inflation is causing the country to slide into a recession, his chief evidence of the economy’s resilience is the continued job growth.", "“As we see the economy as a whole, we do not see it going into a recession,” White House press secretary Karine Jean-Pierre told reporters in anticipation of the latest jobs report.", "Going into the election, Biden and Democrats are already at a disadvantage. Voters generally favor the party out of the White House in midterms, giving Republicans an automatic leg up. When Yale University economist Ray Fair looked at past elections, his model forecast that Democrats would get just 46.4% of the national vote largely because Biden was in the Oval Office.", "Fair’s analysis suggests that inflation basically erased the political boost that Democrats could have gotten from strong economic growth during three quarters in 2021. Even if the economy is top of mind for many voters, the conflicting forces of past growth and high inflation cancel out each other. ", "This makes the Democrats’ vote share roughly the same as suggested by the historical trend, Fair concluded.", "But inflation compounds the obstacles for a president who has tried to convey optimism as he tours the country in the run-up to the elections. Research in social psychology and behavioral economics generally shows that people often focus on the negatives and can block out the positives.", "“People pay more attention to bad news than to good news and are more likely to retain and recall bad news,” said Matthew Incantalupo, a political scientist at Yeshiva University. ", "Incantalupo’s research looks at how voters absorb economic news. When unemployment is low, as it is now, he said, voters generally think about jobs as a personal issue — rather than a systemic one involving government policies. But most think about inflation as a social problem beyond any person’s control, unless that individual happens to run the Fed.", "“When it is high, everyone experiences it at least a little bit, and there really is no individual way to avoid it,” Incantalupo said. “Voters are going to look to government for remedies under those circumstances, and in many cases that will result in them punishing incumbents, even in the presence of other positive news about the economy.”", "Republican candidates have specifically said Biden’s $1.9 trillion coronavirus relief package last year overheated the economy, causing prices to rise alongside the job gains that they claim would have happened anyway as the pandemic receded. They have also said that Biden should have loosened restrictions on oil production, in order to increase domestic output and lower gasoline prices.", "House Republican leader Kevin McCarthy — who could become speaker if the GOP wins a House majority — has hammered Biden on high prices. As Biden has warned that Republicans who deny the outcome of the 2020 election are a threat to democracy, the California congressman countered that what voters care about are the costs of gas and groceries.", "“President Biden is trying to divide and deflect at a time when America needs to unite — because he can’t talk about his policies that have driven up the cost of living,” McCarthy tweeted this past week. “The American people aren’t buying it.”", "Still, inflation is not solely a domestic issue. After Russia invaded Ukraine, energy and food costs rose and suddenly flipped the global dynamics as inflation rose faster in parts of the world with less aggressive coronavirus relief than the U.S. Annual inflation in the euro zone is a ", ", much higher than the 8.2% in the U.S. ", "Meanwhile, growth has slowed in China, the pace of world trade is slipping and Saudi Arabia-led OPEC+ has ", " in order to prop up prices. And because the Fed is raising rates to lower domestic inflation, the dollar has increased in value and ", " to the rest of the world.", "This has left U.S. voters in the curious position of not necessarily blaming the president for inflation, even as they disapprove of his economic leadership.", "An ", " by AP-NORC Center for Public Affairs captured this split. More than half of voters say that prices are higher because of factors beyond Biden’s control. But just 36% approve of his economic leadership."]},
{"url": "https://apnews.com/article/russia-ukraine-zelenskyy-kyiv-europe-terrorism-6eef75649441fa87c7c75f96c3937006", "source": "Associated Press", "title": "Russian soldiers enter Kherson homes, dig in for urban war", "description": "KYIV, Ukraine (AP) — Russian soldiers are forcing Ukrainian civilians from their apartments in the occupied capital of the Kherson region and moving in themselves, a resident said Friday as the southern city became a growing focus of war in Ukraine. ", "date": "2022-11-04T10:38:34Z", "author": "Andrew Meldrum", "text": ["KYIV, Ukraine (AP) — Russian soldiers are forcing Ukrainian civilians from their apartments in the occupied capital of the Kherson region and moving in themselves, a resident said Friday as the southern city became a growing focus of war in Ukraine. ", "His account of soldiers spreading throughout the city of Kherson suggested that Russia could be preparing for intense urban warfare in anticipation of Ukrainian advances.", "Russia-installed authorities in Kherson continued to urge civilians to leave the city, which lies on the western bank of the Dnieper River and has been cut off from supplies and food by Ukrainian bombardment. ", "Kirill Stremousov, the deputy head of the region’s Kremlin-appointed administration, reiterated calls for civilians to depart for the other bank of the river. Stremousov said Thursday that Russian forces might soon withdraw from Kherson city. On Friday, he said the statement was merely an attempt to encourage evacuations.", "Ukrainian President Volodymyr Zelenskyy has suggested the Russians were feigning a pullout from Kherson in order to lure the Ukrainian army into an entrenched battle. Zelenskyy called attempts to convince civilians to move deeper into Russian-controlled territory “theater.”", "A Kherson resident told The Associated Press that Russian soldiers were installing themselves in vacated apartments. Russian military personnel were going door to door, checking property deeds and forcing tenants to leave immediately if they can’t prove ownership of apartments, he said.", "“They’re forcing city residents to evacuate, and then Russian soldiers move into freed-up apartments across all of Kherson,” the resident, who spoke on condition that only his first name — Konstantin — was used for security reasons. “It is obvious that they are preparing for fighting the Ukrainian army in the city.” ", "Hospitals and clinics were not serving patients in Kherson, where residents also reported problems with food supplies.", "“There are almost no deliveries of food into the city, the residents are using their own stocks and are queuing to the few shops that are still open,” Konstantin said.", "Ukrainian military analyst Oleh Zhdanov told the AP that as part of its counteroffensive to reclaim the Kherson region, the Ukrainian army cut off the western bank of the Dnieper from supplies of weapons and food by shelling main transportation routes and ruining bridges across the river.", "“The Russians understand the danger of transport routes being blocked and have practically put up with the fact that they will have to retreat from the right bank of the Dnieper,” Zhdanov said. “But the Russian troops are not prepared to leave Kherson peacefully and are preparing for battles within the city. They’re deploying the mobilized reservists there and new tactical battalion groups.”", "According to Zhdanov, the Ukrainian army has a significant advantage over the Russians in aviation and artillery on the right bank, which means that they could shell the city of Kherson and avoid a head-on clash.", "“Kyiv is taking its time because the Russian resources in Kherson are evaporating, and they’re getting weaker by the day, which allows the Ukrainians to accumulate forces for the main strike,” Zhdanov said.", "Russian forces seized Kherson city soon after invading Ukraine in late February. Russia illegally annexed the Kherson, Donetsk, Luhansk and Zaporizhzhia regions of Ukraine in late September and subsequently declared martial law in the four provinces. ", "The ", " regional administration in Kherson already has moved tens of thousands of civilians out of the city, citing the threat of increased shelling as Ukraine’s army pursues its counteroffensive. ", "Ukraine’s southern military spokeswoman, Natalia Humeniuk, told Ukrainian television that some Russian military personnel were disguising themselves as civilians.", "Neither side’s claims could be independently verified.", "Elsewhere, Ukrainian officials reported shooting down drones launched by Russian forces: eight drones in the Nikopol area, which was also subjected to shelling, and another drone over the western Lviv region.", "The commander of Ukraine’s armed forces, Valeriy Zaluzhny, said Russian forces had “tripled the intensity of hostilities on certain areas of the front” and were carrying out “up to 80 attacks every day.”", "Zelenskyy’s office said at least nine civilians were killed and 16 wounded by attacks in Ukraine in the last day. ", "In Moscow, Russian President Vladimir Putin claimed Friday that there was still a steady stream of volunteers wanting to join the Russian military, with 318,000 people already mobilized. Authorities previously said the goal was to mobilize some 300,000 reservists.", "Putin said 49,000 were already in the army on combat missions, while the rest were still being trained. Russian Defense Minister Sergei Shoigu said Tuesday that 87,000 were deployed to Ukraine. The discrepancy could not be reconciled.", "When Russia announced the mobilization drive in September, protests erupted in several regions and tens of thousands of Russians fled the country. ", "Putin also signed a law Friday permitting the military mobilization of those with expunged or outstanding convictions, including those who have recently served time for murder, robbery and drug trafficking. ", "On the Black Sea grain corridor, Russia agreed Wednesday to rejoin a wartime agreement brokered by the United Nations and Turkey allowing Ukrainian grain to be shipped to world markets through it. Moscow had suspended its participation in the grain deal over the weekend, citing an alleged drone attack against its Black Sea fleet in Crimea.", "The Ukrainian Armed Forces said “the functioning of grain corridors continues” Friday.", "As a condition for returning to the deal, Russia has demanded the grain be sent to poorer countries, arguing that most of it was ending up in richer nations. Turkish President Recep Tayyip Erdogan said Friday he had discussed the issue of prioritizing less developed countries for the grain shipments during a call with U.N. Secretary-General Antonio Guterres.", "Erdogan said he also discussed the possibility of sending the grain to nations facing famine for free, during a recent call with Putin, and the two planned further talks at a Group of 20 meeting in Bali this month.", "___", "Karmanau reported from Tallinn, Estonia. Suzan Fraser in Ankara, Turkey, contributed to this report.", "___", "Follow AP’s coverage of the war in Ukraine: "]},
{"url": "https://apnews.com/article/missing-persons-calculator-c7f9da3fbec2ebebe8411efca3ee1af3", "source": "Associated Press", "title": "New calculator tackles inequality in missing persons stories", "description": "NEW YORK (AP) — If you went missing, how much press would you be “worth”? The Columbia Journalism Review unveiled a tool on Thursday  that calculates the number of stories your disappearance would net, based on demographics. ", "date": "2022-11-03T16:20:35Z", "author": "David Bauder", "text": ["NEW YORK (AP) — If you went missing, how much press would you be “worth”? The Columbia Journalism Review ", " that calculates the number of stories your disappearance would net, based on demographics.", "It sounds morbid but the exercise is designed to call attention to ", " the tendency of news organizations to pay relatively little attention to missing people who don’t fit that category.", "The ", " is credited with coining the term two decades ago. Yet in the interim, there’s been little indication that coverage decisions have evolved.", "“It’s like a bolt that has been rusted in place,” said Jelani Cobb, dean of the Columbia Journalism School.", "The media firestorm around the disappearance and ", " last year renewed scrutiny of the practice, with ", " to give all missing people the same attention.", "Researchers at CJR and the ad agency TBWA/Chiat/Day/New York examined 3,600 stories about missing people done last year by U.S.-based news organizations, cross-referencing them with age, gender and race details from a database maintained by the U.S. Department of Justice.", "The data was used to generate a rough estimate of how much public attention a person would get based on who they are, said Kyle Pope, CJR’s editor in chief and publisher. The starkly named site ", " asks users to enter their age, gender, location and ethnicity.", "As the site goes through each step, the user is informed that the disappearance of older people and men are less likely to make the news. The tool distinguishes between stories in the local and national press, so people in larger cities — where there are more news outlets — have a “higher chance of being reported on than people in rural areas.” White people are the most likely to get covered, while Black and Hispanic people have the lowest chance of coverage.", "About 38% of the people who go missing in the United States are Black, more than double the percentage of Black people in the general population, the Black and Missing Foundation says.", "Black people accounted for 22% of the missing people in the data examined by CJR, and just 13% of the news stories. White people, who made up 47% of the missing person cases, were featured in 70% of the stories.", "According to the calculator, the disappearance of a 22-year-old white woman in New York would generate 67 stories. If she were three years older, that number would drop to 19. And a missing 25-year-old Black woman from New York would get eight. A 50-year-old Black man in the same city would net six.", "The results page also identifies the outlets most and least likely to cover the user’s hypothetical disappearance and calculates what percentage of Americans would hear about you. More than 92% of Americans would have heard about a 22-year-old missing white woman from Nevada, the tool says.", "Why does that matter? “When a missing persons’ case is seen by more people, their chances of being found increase,” the site states.", "There was no comparable data from when “missing white person syndrome” was first talked about two decades ago.", "“We have to place a spotlight on the way that the media functions and the way in which we devalue — inadvertently or not — the lives of people that we’re supposed to cover,” Cobb said.", "Implicit bias is partly to blame, he said, along with a lack of diversity among journalists in decision-making roles and hard-to-break habits.", "“There’s clearly an imbalance,” said Angeline Hartmann, spokesperson for the National Center for Missing & Exploited Children. “What needs to happen is the playing field should be leveled.”", "But Hartmann said there is more than just demographics at play in determining what stories get coverage. The media also gravitates to stories where there are plenty of photos and videos available of the victim — like in Petito’s case — and a family member willing to be an on-camera spokesperson. Those things make journalists’ job easier.", "Similarly, authorities need to take a close look at how situations are characterized, Hartmann said. Sometimes, she said, people are too simplistically characterized as runaways, and thus not included in stories about missing children.", "CJR has made similar efforts to call attention to disinformation and coverage of climate control and issues surrounding guns.", "Pope said he hoped their newest online tool will attract attention on social media, particularly among news consumers who might then put pressure on their local news outlets to keep the issue in mind. Each results page ends with the pictures and names of people who are currently missing and “haven’t received any press coverage at all,” along with an encouragement to contact authorities with any information.", "“It’s one of the reasons why CJR exists, because we do have the attention of the news industry and we need to use it to point out the problems,” Pope said. “I don’t think another kind of earnest op-ed is going to move the needle.”"]},
{"url": "https://apnews.com/article/elon-musk-twitter-inc-business-layoffs-c0334da78b3af9faf2f43cf3f6e52ffa", "source": "Associated Press", "title": "Twitter slashes its staff as Musk era takes hold on platform", "description": "Twitter began widespread layoffs Friday as new owner Elon Musk overhauls the company,  raising grave concerns about chaos enveloping the social media platform and its ability to fight disinformation just days ahead of the U.S. ", "date": "2022-11-04T11:33:17Z", "author": "Barbara Ortutay", "text": ["Twitter began widespread layoffs Friday as new owner Elon Musk ", " raising grave concerns about chaos enveloping the social media platform and its ability to fight disinformation just days ahead of the U.S. midterm elections.", "The speed and size of the cuts also opened Musk and Twitter to lawsuits. At least one was filed alleging Twitter violated federal law by not providing fired employees the required notice.", "The San Francisco-based company told workers by email Thursday that they would learn Friday if they had been laid off. About half of the company’s staff of 7,500 was let go, Yoel Roth, Twitter’s head of safety & integrity, confirmed in a tweet. ", "Musk tweeted late Friday that there was no choice but to cut the jobs “when the company is losing over $4M/day.” He did not provide details on the daily losses at the company and said employees who lost their jobs were offered three months’ pay as a severance. ", "No other social media platform comes close to Twitter as a place where public agencies and other vital service providers — election boards, police departments, utilities, schools and news outlets — keep people reliably informed. Many fear Musk’s layoffs will gut it and render it lawless.", "Roth said the company’s front-line moderation staff was the group the least impacted by the job cuts.", "He added that Twitter’s “efforts on election integrity — including harmful misinformation that can suppress the vote and combatting state-backed information operations — remain a top priority.”", "Musk, meanwhile, tweeted that “Twitter’s strong commitment to content moderation remains absolutely unchanged.”", "But a Twitter employee who spoke with The Associated Press Friday said it will be a lot harder to get that work done starting next week after losing so many colleagues.", "“This will impact our ability to provide support for elections, definitely,” said the employee who spoke on the condition of anonymity out of concerns for job security.", "The employee said there’s no “concrete sense of direction” except for what Musk says publicly on Twitter.", "“I follow his tweets and they affect how we prioritize our work,” said the employee. “It’s a very healthy indicator of what to prioritize.”", "Several employees who tweeted about losing their jobs said Twitter eliminated their entire teams, including one focused on human rights and global conflicts, another checking Twitter’s algorithms for bias in how tweets get amplified, and an engineering team devoted to making the social platform more accessible for people with disabilities.", "Eddie Perez, a Twitter civic integrity team manager who quit in September, said he fears the layoffs so close to the midterms could allow disinformation to “spread like wildfire” during the post-election vote-counting period in particular.", "“I have a hard time believing that it doesn’t have a material impact on their ability to manage the amount of disinformation out there,” he said, adding that there simply may not be enough employees to beat it back.", "President Joe Biden, at a campaign event in Illinois Friday night, said: “Now what are we all worried about? Elon Musk, who goes out and buys an outfit that sends and spews lies all across the world. ... How do we expect kids to be able to understand what is at stake?”", "Twitter’s employees have been expecting layoffs ", ". He ", ", and removed the company’s board of directors on his first day as owner. ", "As the emailed notices went out, many Twitter employees took to the platform to express support for each other — often simply tweeting blue heart emojis to signify its blue bird logo — and salute emojis in replies to each other.", "A Twitter manager said many employees found out they had been laid off when they could no longer log into the company’s systems. The manager said the way the layoffs were conducted showed a “lack of care and thoughtfulness.” The manager, who spoke to the AP on the condition of anonymity out of concerns for job security, said managers were not given any notice about who would be getting laid off.", "“For me as a manager, it’s been excruciating because I had to find out about what my team was going to look like through tweets and through texting and calling people,” the employee said. “That’s a really hard way to care for your people. And managers at Twitter care a lot about their people.”", "A coalition of civil rights groups escalated their calls Friday ", ". The layoffs are particularly dangerous ahead of the elections, the groups warned, and for transgender users and other groups facing violence inspired by hate speech that proliferates online.", "In a tweet Friday, Musk blamed activists for what he described as a “massive drop in revenue” since he took over Twitter late last week.", "Insider Intelligence analyst Jasmine Enberg said there is “little Musk can say to appease advertisers when he’s keeping the company in a constant state of uncertainty and turmoil, and appears indifferent to Twitter employees and the law.”", "“Musk needs advertisers more than they need him,” she said. “Pulling ads from Twitter is a quick and painless decision for most brands.”", "A lawsuit was filed Thursday in federal court in San Francisco on behalf of one employee who was laid off and three others who were locked out of their work accounts. It alleges Twitter violated the law by not providing the required notice. ", "The Worker Adjustment and Retraining Notification statute requires employers with at least 100 workers to disclose layoffs involving 500 or more employees, regardless of whether a company is publicly traded or privately held, as Twitter is now. ", "Twitter filed notifications late Friday in California for its offices in San Francisco, Los Angeles and San Jose. The layoffs affected 983 employees in the state, according to the filings. Twitter said it will continue to pay wages and benefits to the workers through Jan. 4 and employees were notified on Friday. ", "The layoffs affected Twitter’s offices around the world. In the United Kingdom, it would be required by law to give employees notice, said Emma Bartlett, a partner specializing in employment and partnership law at CM Murray LLP. ", "The speed of the layoffs could also open Musk and Twitter up to discrimination claims if it turns out, for instance, that they disproportionally affected women, people of color or older workers.", "___", "AP Business Writers Mae Anderson, Alexandra Olson and Ken Sweet in New York, James Pollard in Columbia, S.C., Frank Bajak in Boston and Danica Kirka in London contributed to this story."]},
{"url": "https://apnews.com/article/health-business-medicare-government-and-politics-1b77c8584602a1abaaa3dfd297f0dbe7", "source": "Associated Press", "title": "Medicare enrollees warned about deceptive marketing schemes", "description": "WASHINGTON (AP) — Mailers designed to look like official government forms. Buses sporting scam pitches for Medicare websites. TV commercials featuring celebrities who encourage people to sign up for Medicare plans that do not always include their current doctors. ", "date": "2022-11-05T04:10:24Z", "author": "Amanda Seitz", "text": ["WASHINGTON (AP) — Mailers designed to look like official government forms. Buses sporting scam pitches for Medicare websites. TV commercials featuring celebrities who encourage people to sign up for Medicare plans that do not always include their current doctors.", "With Medicare’s open enrollment underway through Dec. 7, health experts are warning older adults about an uptick in misleading marketing tactics that might lead some to sign up for Medicare Advantage plans that do not cover their regular doctors or prescriptions and drive up out-of-pocket costs. ", "“It’s a very complicated environment where people are receiving information from companies that are also selling them plans,” said Gretchen Jacobson at the Commonwealth Fund, a health care think tank. “It’s important we find a way to protect and inform consumers.”", "Business is booming in the ", ". Competition for customers is fierce, with insurers turning to marketing agencies and brokers in an effort to help stick out among dozens of plans offered through the program.", "Staff at the Centers for Medicare and Medicaid are on the trail. They are secretly shopping for plans by calling the numbers linked to some online, TV and newspaper ads placed by these marketing firms, according to an agency memo sent to insurers last month. Already, the operation has turned up insurance agents who were using inaccurate information to sell plans. In some cases, ads or agents have overstated the benefits that enrollees would get and the money they would save in the new plans. ", "The government agency can issue warning letters and, in some cases, small civil fines for violations. ", "“CMS is concerned about the marketing practices of all entities, including Third-Party Marketing organizations,” Kathryn A. Coleman, director of the agency’s Medicare Drug and Health Plan Contract Administration Group, wrote in the letter. ", "The agency reported a spike in complaints last year around misleading Medicare Advantage ads, receiving nearly 40,000 compared to 15,000 in 2020. Data is not yet available for this year. ", "Democrats on the Senate Finance Committee ", " showing that several states also reported an increase in complaints around deceptive marketing schemes in 2021. ", "In Ohio, for example, older adults received mailers resembling federal government tax forms that featured promises of bigger Social Security checks if they enrolled in a new Medicare Advantage plan. State officials also reported that a bus was designed to look like an official Medicare bus, but displayed an advertising a link to an insurance broker. ", "Nationwide TV ads, too, have misled some customers, the committee’s report found. ", "One ad, featuring a former NFL football player, failed to tell viewers that plans vary by ZIP code or that some providers will not be in network — meaning higher out-of-pocket costs for consumers — while promising to “add money back to your Social Security check.” ", "The committee surveyed 15 states about complaints about Medicare Advantage marketing, finding that 9 of 10 states that tracked such complaints saw an increase in reports from 2020 to 2021. ", "“It is unacceptable for this magnitude of fraudsters and scam artists to be running amok in Medicare and I will be working closely with CMS to ensure this dramatic increase in marketing complaints is addressed,” said the committee chairman, Sen. Ron Wyden, D-Ore.", "In the memo last month, the government agency said it had reviewed thousands of complaints, finding “numerous issues.” It is also requiring that insurance agents and brokers record enrollment calls with clients so they can be reviewed if complaints are lodged. CMS said insurance companies are responsible for the material published on their behalf by agents, brokers or marketing companies they contract with. ", "In Georgia, state officials are tracking an increase in marketing around the plans and say they are fielding more calls from people who are worried about the plans they enrolled in, said Christine Williams of the State Health Insurance Assistance Program. In some cases, callers have said they enrolled in a plan that didn’t allow them to see their providers. ", "She said people who are enrolling in Medicare Advantage should ask brokers or agents how doctors, prescriptions and services, including dental or vision care, are covered by the plans they are selling. Every state also offers counselors to help people navigate the enrollment process. ", "“Really ask specific questions,” Williams said. "]},
{"url": "https://apnews.com/article/brooklyn-nets-nba-sports-kyrie-irving-racial-injustice-972e41eed3debbd9a548433c78227f05", "source": "Associated Press", "title": "Nike splits with Kyrie Irving amid antisemitism fallout", "description": "Nike has suspended its relationship with Kyrie Irving and canceled its plans to release his next signature shoe, the latest chapter in the ongoing fallout since the Brooklyn Nets guard tweeted a link to a film containing antisemitic material. ", "date": "2022-11-05T01:16:35Z", "author": "Tim Reynolds", "text": ["Nike has suspended its relationship with Kyrie Irving and canceled its plans to release his next signature shoe, the latest chapter in the ongoing fallout since the Brooklyn Nets guard tweeted a link to a film containing antisemitic material.", "The shoe giant announced Friday night that it will halt its relationship with Irving, who has been suspended by the Nets for what the team called a repeated failure to “unequivocally say he has no antisemitic beliefs.”", "The Nets made that move Thursday, ", " and a day later, Nike made its decision. Those actions followed widespread criticism — from, among many others, the Anti-Defamation League and NBA Commissioner Adam Silver.", "“At Nike, we believe there is no place for hate speech and we condemn any form of antisemitism,” the Beaverton, Oregon-based company said. “To that end, we’ve made the decision to suspend our relationship with Kyrie Irving effective immediately and will no longer launch the Kyrie 8.”", "Irving has had a signature line with Nike since 2014.", "“We are deeply saddened and disappointed by the situation and its impact on everyone,” Nike said.", "Irving signed with Nike in 2011, shortly after becoming the No. 1 pick in that year’s NBA draft. Irving’s first signature shoe was released three years later, and the popularity of the Kyrie line led to him making a reported $11 million annually just from the Nike endorsement.", "The Kyrie 8 was expected to be released in the next week. Previous models of his shoes were still for sale on the Nike website Friday night.", "Irving posted a tweet — which has since been deleted — last week with a link to the documentary “Hebrews to Negroes: Wake Up Black America,” which includes Holocaust denial and conspiracy theories about Jews. In a contentious postgame interview session last Saturday, Irving defended his right to post what he wants.", "The fallout only continued from there. The NBA put out a statement over the weekend that didn’t name Irving but denounced all forms of hate speech. ", " occupied some courtside seats at the Brooklyn-Indiana game on Monday night, a day after he took down the tweet. The Nets and coach Steve Nash parted ways Tuesday, a development that has been overshadowed by the Irving saga.", "On Wednesday, Irving said he opposes all forms of hate, and he and the Nets each announced that they would each donate $500,000 toward groups that work to eradicate it. Silver then issued a new statement calling on Irving by name to apologize, and Irving refused to give a direct answer when asked Thursday if he has antisemitic beliefs.", "That, evidently, was the last straw for the Nets, who suspended him. Hours later, ", " for not explaining the specific beliefs he agreed and disagreed with when he posted the documentary.", "“To All Jewish families and Communities that are hurt and affected from my post, I am deeply sorry to have caused you pain, and I apologize,” Irving wrote. “I initially reacted out of emotion to being unjustly labeled Anti-Semitic, instead of focusing on the healing process of my Jewish Brothers and Sisters that were hurt from the hateful remarks made in the Documentary.”", "A day later, Nike — which had also been criticized for not moving more swiftly — took action.", "Irving becomes the second celebrity in less than two weeks to lose a major shoe deal over antisemitism. ", " a move the German company said would result in about $250 million in losses this year after stopping production of its line of Yeezy products as well as halting payments to Ye and his companies.", "For weeks, Ye made antisemitic comments in interviews and on social media, including a Twitter post that he would soon go “death con 3 on JEWISH PEOPLE,” an apparent reference to the U.S. defense readiness condition scale known as DEFCON.", "Irving has expressed no shortage of controversial opinions during his career. He repeatedly questioned whether the Earth was round before eventually ", ". Last year, his refusal to get a COVID-19 vaccine led to him being banned from playing in most of the Nets’ home games.", "The Nets played at Washington on Friday, winning 128-86 without Irving. The 42-point win matched the fourth-largest in Nets franchise history.", " that Irving’s apology was a step forward, but many other steps will be required before he can resume playing.", "“There is going to be some remedial steps and measures that have been put in place for him to obviously seek some counseling ... from dealing with some anti-hate and some Jewish leaders within our community,” Marks said. “He’s going to have to sit down with them, he’s going to have to sit down with the organization after this, and we’ll evaluate and see if this is the right opportunity to bring him back.”", "___", "AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"]},
{"url": "https://apnews.com/article/entertainment-paul-haggis-66d9deb629819e633c00168660626733", "source": "Associated Press", "title": "Filmmaker Haggis finishes testimony, denies claims by women", "description": "NEW YORK (AP) — Filmmaker Paul Haggis choked up and wiped away tears while finishing his defense Friday from the witness stand against a civil trial rape claim by a publicist. Haggis, 69, reached for tissues after his lawyer finished questioning him a final time following cross examination that began Thursday and stretched into Friday afternoon. ", "date": "2022-11-04T23:20:32Z", "author": "Larry Neumeister", "text": ["NEW YORK (AP) — Filmmaker Paul Haggis choked up and wiped away tears while finishing his defense Friday from the witness stand against a civil trial rape claim by a publicist.", "Haggis, 69, reached for tissues after his lawyer finished questioning him a final time following cross examination that began Thursday and stretched into Friday afternoon.", "After three days of testimony, the winner of Oscars for “Crash” and “Million Dollar Baby” was emotional as he described himself as “a very flawed human being.”", "He also said he made “Crash,” a 2004 film about Los Angeles individuals forced to confront racial issues when their vastly different lives cross one another, because he “couldn’t figure out how to be good.”", "The remark by Haggis prompted his attorney, Priya Chaudhry, to ask if his self-criticism was a reference to sexually assaulting anyone.", "“Oh, God no!” he answered.", "Chaudhry’s questions came after attorney Ilann Maazel confronted Haggis with dozens of inconsistencies between his testimony from the witness stand and a video recording of a deposition in which he was asked many of the same questions.", "Maazel represents ", " earlier in the trial that Haggis took her to his Manhattan apartment for a drink after a January 2013 screening afterparty. She said he pushed her on a bed, pulled her clothes off, aggressively demanded oral sex and — after she took a shower — raped her. She is seeking unspecified damages.", "The Associated Press generally does not name people who say they have been sexually assaulted unless they come forward publicly, as Breest has done.", "In one instance of an inconsistency in testimony, Maazel tried to show that Haggis had admitted to over 25 affairs while he was married rather than 20 affairs.", "He also elicited testimony about physical violence between Haggis and an ex-wife, with Maazel saying Haggis once hit her so hard that she had bruising.", "“She had a black eye,” Haggis responded. Haggis also said he was the victim of “a very fiery person” who hit and punched him over the years.", "The trial resumes Monday. Jurors were told that closing arguments are likely on Wednesday, when they would probably begin deliberations."]},
{"url": "https://apnews.com/article/business-lawsuits-freedom-of-information-act-5496b94bd7089669ab404eca7fc8569e", "source": "Associated Press", "title": "Settlement reached in suits over FBI posing as AP reporter", "description": "WASHINGTON (AP) — The Reporters Committee for Freedom of the Press will get a $145,000 settlement following a pair of lawsuits filed after an FBI agent posed as a reporter for The Associated Press and created a fake story. ", "date": "2022-11-04T22:38:01Z", "author": "Lindsay Whitehurst", "text": ["WASHINGTON (AP) — The Reporters Committee for Freedom of the Press will get a $145,000 settlement following a pair of lawsuits filed after an FBI agent posed as a reporter for The Associated Press and created a fake story. ", "The long-running Freedom of Information Act cases led to appeals court decisions that will help bolster access to public records, said Adam Marshall, an attorney for the group. The cases also shed light on FBI agents posing as members of the media, a tactic that free press advocates say undermines media credibility and blurs lines between law enforcement and the press.", "The agency failed to follow its own rules over such undercover operations when an agent ", " and sent a link to a fake story in an investigation in Washington state in 2007, according to documents uncovered in the lawsuit filed along with The Associated Press.", "Then-FBI Director James Comey called the technique “proper and appropriate” under FBI guidelines at the time, though he said it would require higher-level approvals when the incident came to light seven years later, in 2014. No actual story was published and it led to an arrest, he maintained. ", "The agent posing as an AP reporter sent a link to the fake article to a 15-year-old suspected of making bomb threats at a high school. When the teen clicked the link, a tracking tool revealed his computer’s location and helped agents confirm his identity.", "The FBI declined to comment Friday.", "Kathleen Carroll, then executive editor of the AP, said in 2014 that the FBI’s “unacceptable tactics undermine AP and the vital distinction between the government and the press.” A letter signed by two dozen news organizations called the revelations “inexcusable” and the Reporter’s Committee specifically called out the use of the AP’s name as “cover for delivery of electronic surveillance software.”", "Lauren Easton, an Associated Press spokeswoman, declined additional comment Friday. ", "The lawsuits were filed as part of an effort to get records about FBI news-media impersonations, and eventually resulted in important court decisions about how far agencies must go in searching for requested documents and the standards they must meet in order to withhold documents, Marshall said. The settlement will cover attorney’s fees and costs. ", "“This has shown that there are significant, concerning and ongoing issues with respect to federal law enforcement impersonation of the press in the United States,” Marshall said. The cases have also “shown that the Reporters Committee and The Associated Press were committed to finding out as much as we could about what happened here for the public to know.”"]},
{"url": "https://apnews.com/article/biden-inflation-economy-economic-growth-government-and-politics-ea50755f87fa765d038b16a2d0e4fc4c", "source": "Associated Press", "title": "Biden stumps on job growth, as voters dread inflation", "description": "WASHINGTON (AP) — President Joe Biden has notched an envious record on jobs, with 10.3 million gained during his tenure. But voters in Tuesday's midterm elections are far more focused on inflation  hovering near 40-year highs . ", "date": "2022-11-05T04:14:18Z", "author": "Josh Boak", "text": ["WASHINGTON (AP) — President Joe Biden has notched an envious record on jobs, with 10.3 million gained during his tenure. But voters in Tuesday’s midterm elections are far more ", " hovering near ", ".", "That’s left the president trying to convince the public that the job gains mean better days are ahead, even as ", " build. ", "Presidents have long trusted that voters would reward them for strong economic growth, but inflation has thrown a monkey wrench into the already difficult probability of Democrats’ retaining control of the ", ". ", "Economic anxieties have compounded as the Federal Reserve has ", " its benchmark interest rates to lower inflation and possibly raise unemployment. Mortgage costs have shot upwards, while the S&P 500 stock index has dropped more than 20% so far this year as the world braces for a possible downturn.", "Biden is asking voters to look beyond the current financial pain, saying that what matters are the job gains that he believes his policies are fostering. The government reported Friday that employers added ", " as the unemployment rate bumped up to 3.7%. ", "Roughly 740,000 manufacturing jobs have been added since the start of Biden’s presidency, a figure that the president says will keep rising because of his funding for infrastructure projects, the production of computer chips and the switch to clean energy sources.", "“America is reasserting itself — it’s as simple as that,” Biden said in a Friday speech. “We also know folks are still struggling with inflation. It’s our number one priority.”", "Yet the president is also warning that a Republican majority in Congress could make inflation worse by seeking to undo his programs and treating payments on the federal debt as a bargaining chip instead of an obligation to honor. ", "His challenge is that the party in power generally faces skeptical voters in U.S. midterms and inflation looms over the public mindset more than job growth.", "“If you have a job, it’s small comfort to know that the job market is strong if at the same time you feel like every paycheck is worth less and less anyway,” said pollster Kristen Soltis Anderson. “Inflation is such political poison because voters are reminded every day whenever they spend money that it is a problem we are experiencing.”", "As Biden tries to fend off fears that inflation is causing the country to slide into a recession, his chief evidence of the economy’s resilience is the continued job growth.", "“As we see the economy as a whole, we do not see it going into a recession,” White House press secretary Karine Jean-Pierre told reporters in anticipation of the latest jobs report.", "Going into the election, Biden and Democrats are already at a disadvantage. Voters generally favor the party out of the White House in midterms, giving Republicans an automatic leg up. When Yale University economist Ray Fair looked at past elections, his model forecast that Democrats would get just 46.4% of the national vote largely because Biden was in the Oval Office.", "Fair’s analysis suggests that inflation basically erased the political boost that Democrats could have gotten from strong economic growth during three quarters in 2021. Even if the economy is top of mind for many voters, the conflicting forces of past growth and high inflation cancel out each other. ", "This makes the Democrats’ vote share roughly the same as suggested by the historical trend, Fair concluded.", "But inflation compounds the obstacles for a president who has tried to convey optimism as he tours the country in the run-up to the elections. Research in social psychology and behavioral economics generally shows that people often focus on the negatives and can block out the positives.", "“People pay more attention to bad news than to good news and are more likely to retain and recall bad news,” said Matthew Incantalupo, a political scientist at Yeshiva University. ", "Incantalupo’s research looks at how voters absorb economic news. When unemployment is low, as it is now, he said, voters generally think about jobs as a personal issue — rather than a systemic one involving government policies. But most think about inflation as a social problem beyond any person’s control, unless that individual happens to run the Fed.", "“When it is high, everyone experiences it at least a little bit, and there really is no individual way to avoid it,” Incantalupo said. “Voters are going to look to government for remedies under those circumstances, and in many cases that will result in them punishing incumbents, even in the presence of other positive news about the economy.”", "Republican candidates have specifically said Biden’s $1.9 trillion coronavirus relief package last year overheated the economy, causing prices to rise alongside the job gains that they claim would have happened anyway as the pandemic receded. They have also said that Biden should have loosened restrictions on oil production, in order to increase domestic output and lower gasoline prices.", "House Republican leader Kevin McCarthy — who could become speaker if the GOP wins a House majority — has hammered Biden on high prices. As Biden has warned that Republicans who deny the outcome of the 2020 election are a threat to democracy, the California congressman countered that what voters care about are the costs of gas and groceries.", "“President Biden is trying to divide and deflect at a time when America needs to unite — because he can’t talk about his policies that have driven up the cost of living,” McCarthy tweeted this past week. “The American people aren’t buying it.”", "Still, inflation is not solely a domestic issue. After Russia invaded Ukraine, energy and food costs rose and suddenly flipped the global dynamics as inflation rose faster in parts of the world with less aggressive coronavirus relief than the U.S. Annual inflation in the euro zone is a ", ", much higher than the 8.2% in the U.S. ", "Meanwhile, growth has slowed in China, the pace of world trade is slipping and Saudi Arabia-led OPEC+ has ", " in order to prop up prices. And because the Fed is raising rates to lower domestic inflation, the dollar has increased in value and ", " to the rest of the world.", "This has left U.S. voters in the curious position of not necessarily blaming the president for inflation, even as they disapprove of his economic leadership.", "An ", " by AP-NORC Center for Public Affairs captured this split. More than half of voters say that prices are higher because of factors beyond Biden’s control. But just 36% approve of his economic leadership."]},
{"url": "https://apnews.com/article/san-francisco-nancy-pelosi-government-and-politics-paul-d9e501d8ff21fa8533b5a4fee9fae99f", "source": "Associated Press", "title": "Pelosi makes first public remarks since husband's assault", "description": "SAN FRANCISCO (AP) — House Speaker Nancy Pelosi, in her first public appearance since the brutal attack on her husband, rallied grassroots activists Friday, saying the midterm elections  for control of Congress are a fight for democracy and “very winnable.” ", "date": "2022-11-04T18:02:24Z", "author": "Olga R. Rodriguez", "text": ["SAN FRANCISCO (AP) — House Speaker Nancy Pelosi, in her first public appearance since the brutal attack on her husband, rallied grassroots activists Friday, saying the ", " for control of Congress are a fight for democracy and “very winnable.”", "“People say to me, ‘What can I do to make you feel better?’ I say: ‘Vote!’” Pelosi told those on the call. ", "“I believe that this race is very winnable,” Pelosi said.", "Her voice cracked at times as she said of her husband’s recovery, “It’s going to be a long haul.” ", "Pelosi thanked those on a video call for the outpouring of support for Paul Pelosi, 82, who suffered a fractured skull and other injuries after an intruder broke into their San Francisco home late last week and bludgeoned him with a hammer in what authorities say was an intentional and political attack. ", "The Democratic leader spoke in the early morning from California, where ", " late Thursday, her voice breaking throughout the lengthy but upbeat address.", "“What we are doing is not only to win an election, but this is to strengthen our democracy,” Pelosi said. “There is no question that our democracy is on the ballot.”", "The speaker’s comments come as Democrats are facing a stiff fight for control of Congress in the midterm elections Tuesday, as energized Republicans are working to flip the House and Senate and end Democratic hold on Washington.", "David DePape, 42, is being held without bail on state charges of attempted murder, burglary and elder abuse. DePape’s public defender, Adam Lipson, entered a not guilty plea on his behalf earlier this week and has pledged to vigorously defend him. Lipson declined to comment Friday.", "At a hearing Friday, a San Francisco judge disclosed that she had worked with Speaker Pelosi’s daughter in the 1990s, giving prosecutors and the public defender’s office the opportunity to object to her role in the case.", "Judge Loretta “Lori” Giorgi said she and Christine Pelosi had worked together in the San Francisco city attorney’s office in the 1990s but had not interacted in years. Christine is one of the Pelosis’ five adult children and while she has never held elected office, she’s considered to be a potential successor when Pelosi retires from her House seat.", " officials said DePape broke into the home, carrying zip ties, tape and a rope in a backpack. He woke up Paul Pelosi and ", " who was out of town. Two officers who raced to the home after Paul Pelosi’s 911 call witnessed DePape hit him in the head with the hammer.", "No one objected during Friday’s hearing to Giorgi’s ties to the Pelosi family but either side could in the future and San Francisco District Attorney Brooke Jenkins said the case might be heard by another judge regardless. The public defender’s office did not immediately have a comment.", "“I do want to make a disclosure on the record that the daughter of Mr. Pelosi, Christine Pelosi, and I were in the city attorney’s office together in the 90s,” Giorgi told the court. “And I have disclosed to counsel the interactions that I had when she and I were together. I haven’t seen or heard or talked to Ms. Pelosi after she left the office. I do see her here today.”", "Giorgi worked in the city attorney’s office from 1985 to 2006, when she was appointed to the bench. She rose to the rank of deputy city attorney and was the office’s public integrity chief.", "Christine Pelosi attended Friday’s hearing but seemed to leave through a back door in order to avoid media waiting in the hallway. She entered the courtroom right before the proceeding started and sat in the front row away from reporters.", " is active in California and national Democratic politics. In 2019, she released a book about her mother titled “The Nancy Pelosi Way.” In 2017, as chair of the California Democratic Party’s women’s caucus, she was actively involved in the #MeToo movement as it took shape in the state capital.", "The city attorney’s office did not immediately respond to a request for details of Giorgi and Christine Pelosi’s employment.", "DePape, who is Canadian, ", " more than two decades ago. He should have been blocked from getting back into the country when he returned a few times over the years, according to a U.S. official who spoke to The Associated Press on the condition of anonymity because they were not authorized to discuss the matter. ", "___", "Mascaro reported from Washington. Associated Press writers Stefanie Dazio in Los Angeles, Elliot Spagat in San Diego and Kathleen Ronayne in Sacramento, California, contributed to this story."]},
{"url": "https://apnews.com/article/harvey-weinstein-los-angeles-sexual-assault-ede1910409d14e7f0517831b60b5a18b", "source": "Associated Press", "title": "Weinstein attorney, accuser clash over her memory of assault", "description": "LOS ANGELES (AP) — An attorney for Harvey Weinstein  suggested Thursday that the shifts in a massage therapist's account of a 2010 sexual assault by the former movie mogul meant she had fabricated details, while she insisted that working through the trauma had drawn out more accurate memories. ", "date": "2022-11-04T01:25:55Z", "author": "Andrew Dalton", "text": ["LOS ANGELES (AP) — An attorney for ", " suggested Thursday that the shifts in a massage therapist’s account of a 2010 sexual assault by the former movie mogul meant she had fabricated details, while she insisted that working through the trauma had drawn out more accurate memories. ", "Weinstein attorney Mark Werksman pointed out differences over time in stories she told to police and prosecutors in 2019 and 2020, in her testimony to a grand jury last year, and in her ", ", when she said Weinstein had trapped her in a bathroom, masturbated in front of her and groped her breasts after hiring her for a massage in his Beverly Hills hotel room.", "“Do you think your memory is better now than it was three years ago?” Werksman asked.", "“Yes,” she answered. At another point she said, “My memory was foggy then, but I remember everything now.”", "The woman said discussions about the assault with friends, authorities, a therapist and others had brought clarity and made her face difficult details that she had buried in her memory.", "Werksman asked if the conversations represented an effort “to build consensus.”", "The woman insisted it wasn’t.", "“The more I spoke about it, the more I recalled the trauma that happened to me,” she said. “I was blocking it out for so long.”", "The woman is going by Jane Doe in court. The Associated Press does not typically name people who say they have been sexually abused. ", "Weinstein is charged with sexual battery by restraint for the incident, one of 11 sexual assault counts involving five women he’s charged with at his Los Angeles trial. He has pleaded not guilty and denied engaging in any non-consensual sex. He is already serving a 23-year sentence for a conviction in New York.", "Werksman especially dwelt on whether Weinstein touched her over or under her clothes, suggesting her story suspiciously shifted over time to include the skin-on-skin contact required by California law for sexual battery.", "“You didn’t change your story from ‘it didn’t happen at all,’ to ‘I’m 95% sure’ to ‘I’m 100% sure’ so that they could criminally prosecute Mr. Weinstein?” Werksman asked.", "“No,” she said.", "“Your story is like the US economy, eight percent inflation, isn’t it?” Werksman said, though the judge rejected the question after an objection.", "She testified Wednesday that she had been embarrassed and humiliated that she had allowed herself to be alone with Weinstein several times more, including two more massages where she said he engaged in similar unwanted sexual behavior.", "The defense seized on the issue during cross-examination.", "“He calls for another massage, and you say ‘buzz off creep’ and hang up, right?” Werksman asked.", "“No,” woman said.", "“No, Werksman replied, ”you schedule another massage.”", "During the first massage, Weinstein and the woman discussed her writing a book about her techniques for the publishing arm of his movie company, Miramax.", "Werksman suggested that the woman had done a consensual sexual favor for Weinstein to better her chances of being published.", "“You pursued a book deal because that was your end of a bargain for having sexual relations with Mr. Weinstein, correct?” he asked.", "“Incorrect,” she said.", "The woman said the book had been Weinstein’s idea, and while she was intrigued and took part in several months of emails with his employees, the decision to drop it was mutual.", "___", "Follow AP Entertainment Writer Andrew Dalton on Twitter: twitter.com/andyjamesdalton", "___", "For more on the Harvey Weinstein trial, visit: https://apnews.com/hub/harvey-weinstein"]},
{"url": "https://apnews.com/article/jerry-lee-lewis-dead-165d562af27b23da9d6d11fc480541e8", "source": "Associated Press", "title": "Jerry Lee Lewis, outrageous rock ‘n’ roll star, dies at 87", "description": "Jerry Lee Lewis,  the untamable rock ‘n’ roll pioneer whose outrageous talent, energy and ego collided on such definitive records as “Great Balls of Fire” and “Whole Lotta Shakin' Goin' On\" and sustained a career otherwise upended by personal scandal, died Friday morning at 87. ", "date": "2022-10-28T16:52:45Z", "author": "Hillel Italie", "text": [" the untamable rock ‘n’ roll pioneer whose outrageous talent, energy and ego collided on such definitive records as “Great Balls of Fire” and “Whole Lotta Shakin’ Goin’ On” and sustained a career otherwise upended by personal scandal, died Friday morning at 87.", "The last survivor of a generation of groundbreaking performers that included Elvis Presley, Chuck Berry and Little Richard, Lewis died at his Mississippi home, south of Memphis, Tennessee, representative Zach Farnum said in a release. The news came two days after the publication of an erroneous TMZ report of his death, later retracted. ", "Of all the rock rebels to emerge in the 1950s, few captured the new genre’s attraction and danger as unforgettably as the Louisiana-born piano player who called himself “The Killer.”", "Tender ballads were best left to the old folks. Lewis was all about lust and gratification, with his leering tenor and demanding asides, violent tempos and brash glissandi, cocky sneer and crazy blond hair. He was a one-man stampede who made the fans scream and the keyboards swear, his live act so combustible that during a 1957 performance of “Whole Lotta Shakin’ Goin’ On” on “The Steve Allen Show,” chairs were thrown at him like buckets of water on an inferno.", "“There was rockabilly. There was Elvis. But there was no pure rock ’n ’roll before Jerry Lee Lewis kicked in the door,” a Lewis admirer once observed. That admirer was Jerry Lee Lewis. ", "But in his private life, he raged in ways that might have ended his career today — and nearly did back then.", "For a brief time, in 1958, he was a contender to replace Presley as rock’s prime hit maker after Elvis was drafted into the Army. But while Lewis toured in England, the press learned three damaging things: He was married to 13-year-old (possibly even 12-year-old) Myra Gale Brown, she was his cousin, and he was still married to his previous wife. His tour was canceled, he was blacklisted from the radio and his earnings dropped overnight to virtually nothing.", "“I probably would have rearranged my life a little bit different, but I never did hide anything from people,” Lewis told the Wall Street Journal in 2014 when asked about the marriage. “I just went on with my life as usual.”", "Over the following decades, Lewis struggled with drug and alcohol abuse, legal disputes and physical illness. Two of his many marriages ended in his wife’s early death. Brown herself divorced him in the early 1970s and would later allege physical and mental cruelty that nearly drove her to suicide.", "“If I was still married to Jerry, I’d probably be dead by now,” she told People magazine in 1989.", "Lewis reinvented himself as a country performer in the 1960s, and the music industry eventually forgave him, long after he stopped having hits. He won three Grammys, and recorded with some of the industry’s greatest stars. In 2006, Lewis came out with “Last Man Standing,” featuring Mick Jagger, Bruce Springsteen, B.B. King and George Jones. In 2010, Lewis brought in Jagger, Keith Richards, Sheryl Crow, Tim McGraw and others for the album “Mean Old Man.”", "In “The Rolling Stone Illustrated History of Rock & Roll,” first published in 1975, he recalled how he convinced disc jockeys to give him a second chance.", "“This time I said, ‘Look, man, let’s get together and draw a line on this stuff — a peace treaty you know,’” he explained. Lewis would still play the old hits on stage, but on the radio he would sing country.", "Lewis had a run of top 10 country hits between 1967-70, and hardly mellowed at all. He performed drinking songs such as “What’s Made Milwaukee Famous (Has Made a Loser Out of Me)”, the roving eye confessions of “She Still Comes Around” and a dry-eyed cover of a classic ballad of abandonment, “She Even Woke Me Up to Say Goodbye.” He had remained popular in Europe and a 1964 album, “Live at the Star Club, Hamburg,” is widely regarded as one of the greatest concert records.", "A 1973 performance proved more troublesome: Lewis sang for the Grand Ole Opry and broke two longstanding rules — no swearing and no non-country songs.", "“I am a rock and rollin’, country-and-western, rhythm and blues-singin’ motherf-----,” he told the audience.", "Lewis married seven times, and was rarely far from trouble or death. His fourth wife, Jaren Elizabeth Gunn Pate, drowned in a swimming pool in 1982 while suing for divorce. His fifth wife, Shawn Stephens, 23 years his junior, died of an apparent drug overdose in 1983. Within a year, Lewis had married Kerrie McCarver, then 21. She filed for divorce in 1986, accusing him of physical abuse and infidelity. He countersued, but both petitions eventually were dropped. They finally divorced in 2005 after several years of separation. The couple had one child, Jerry Lee III.", "Another son by a previous marriage, Steve Allen Lewis, 3, drowned in a swimming pool in 1962, and son Jerry Lee Jr. died in a traffic accident at 19 in 1973. Lewis also had two daughters, Phoebe and Lori Leigh, and is survived by his wife Judith.", "His finances were also chaotic. Lewis made millions, but he liked his money in cash and ended up owing hundreds of thousands of dollars ", " When he began welcoming tourists in 1994 to his longtime residence near Nesbit, Mississippi — complete with a piano-shaped swimming pool — he set up a 900 phone number fans could call for a recorded message at $2.75 a minute.", "The son of one-time bootlegger Elmo Lewis and the cousin of TV evangelist Jimmy Swaggart and country star Mickey Gilley, Lewis was born in Ferriday, Louisiana (Swaggart and Lewis released “The Boys From Ferriday,” a gospel album, earlier this year). As a boy, he first learned to play guitar, but found the instrument too confining and longed for an instrument that only the rich people in his town could afford — a piano. His life changed when his father pulled up in his truck one day and presented him a dark-wood, upright piano.", "“My eyes almost fell out of my head,” Lewis recalled in “Jerry Lee Lewis: His Own Story,” written by Rick Bragg and published in 2014.", "He took to the piano immediately, and began sneaking off to Black juke joints and absorbing everything from gospel to boogie-woogie. Conflicted early on between secular and sacred music, he quit school at 16, with plans of becoming a piano-playing preacher. Lewis briefly attended Southwestern Assemblies of God University in Waxahachie, Texas, a fundamentalist Bible college, but was expelled, reportedly, for playing the “wrong” kind of music.", "“Great Balls of Fire,” a sexualized take on Biblical imagery that Lewis initially refused to record, and “Whole Lotta Shakin’” were his most enduring songs and performance pieces. Lewis had only a handful of other pop hits, including “High School Confidential” and “Breathless,” but they were enough to ensure his place as a rock ‘n’ roll architect.", "“No group, be it (the) Beatles, Dylan or Stones, have ever improved on ’Whole Lotta Shakin” for my money,” John Lennon would tell Rolling Stone in 1970.", "A roadhouse veteran by his early 20s, Lewis took off for Memphis in 1956 and showed up at the studios of Sun Records, the musical home of Elvis, Carl Perkins and Johnny Cash. Told by company founder Sam Phillips to go learn some rock ‘n roll, Lewis returned and soon hurried off “Whole Lotta Shakin’” in a single take.", "“I knew it was a hit when I cut it,” he later said. “Sam Phillips thought it was gonna be too risque, it couldn’t make it. If that’s risque, well, I’m sorry.”", "In 1986, along with Elvis, Chuck Berry and others, he made the inaugural class of inductees for the Rock & Roll Hall of Fame and ", " this year. The Killer not only outlasted his contemporaries but saw his life and music periodically reintroduced to younger fans, including the 1989 biopic “Great Balls of Fire,” starring Dennis Quaid, and ", " A 2010 Broadway music, “Million Dollar Quartet,” was inspired by a recording session that featured Lewis, Elvis, Perkins and Cash.", "He won a Grammy in 1987 as part of an interview album that was cited for best spoken word recording, and he received a lifetime achievement Grammy in 2005. The following year, “Whole Lotta Shakin’” was selected for the Library of Congress’ National Recording Registry, whose board praised the “propulsive boogie piano that was perfectly complemented by the drive of J.M. Van Eaton’s energetic drumming. The listeners to the recording, like Lewis himself, had a hard time remaining seated during the performance.”", "A classmate at Bible school, Pearry Green, remembered meeting Lewis years later and asking if he was still playing the devil’s music.", "“Yes, I am,” Lewis answered. “But you know it’s strange, the same music that they kicked me out of school for is the same kind of music they play in their churches today. The difference is, I know I am playing for the devil and they don’t.”", "___", "This story has been updated to clarify where Lewis’ home is located."]},
{"url": "https://apnews.com/article/ron-desantis-health-business-florida-government-and-politics-78e417a184718de8b9e71ff32efbc77f", "source": "Associated Press", "title": "Florida to ban transgender health care treatments for minors", "description": "TALLAHASSEE, Fla. (AP) — Transgender children in Florida will be barred from receiving hormones or undergoing surgeries to treat gender dysphoria  under a rule approved Friday by state medical officials at the urging of Republican Gov. ", "date": "2022-11-04T22:53:14Z", "author": "Anthony Izaguirre", "text": ["TALLAHASSEE, Fla. (AP) — Transgender children in Florida will be barred from receiving hormones or undergoing surgeries to treat ", " under a rule approved Friday by state medical officials at the urging of Republican Gov. Ron DeSantis.", "The Florida Board of Medicine and the state Board of Osteopathic Medicine voted at a joint meeting in Lake Buena Vista to finalize ", " governing gender affirming health care for minors. The rule is set to take effect after a weekslong public input period. ", "The ban comes as DeSantis and Republicans in other states move to limit access to the treatments for minors, often characterizing them as medically unproven and potentially dangerous in the long term, as another political battle against liberal ideologies.", "Many doctors, mental health specialists and medical groups have argued that treatments for transgender youth are safe and beneficial, though rigorous long-term research is lacking. Federal health officials have described the gender-affirming care as crucial to the health and well-being of transgender children and adolescents. ", " has made criticizing such treatments for minors a routine part of his reelection campaign, often referring to the procedures in graphic terms during rallies and speeches. The new policy, finalized days before the election, marks another example of DeSantis’ ability to leverage the power of government to accomplish controversial political goals, bolstering his national reputation as a combative GOP culture warrior. ", "The rule prohibits doctors from prescribing puberty-blocking, hormone and hormone antagonist therapies to treat gender dysphoria in minors. It bans sex reassignment surgeries or other surgical procedures that alter primary or secondary sexual characteristics in minors. ", "“Today’s vote from the Boards of Medicine and Osteopathic Medicine will protect our children from irreversible surgeries and highly experimental treatments. I appreciate the integrity of the Boards for ruling in the best interest of children in Florida despite facing tremendous pressure to permit these unproven and risky treatments. Children deserve to learn how to navigate this world without harmful pressure, and Florida will continue to fight for kids to be kids,” Florida Surgeon General Joseph Ladapo said in a statement. ", " banned state Medicaid insurance coverage for gender dysphoria treatments this year and issued a report that said the treatments have not been proven safe or effective. After the report’s publication, Ladapo, a DeSantis appointee, called for the adoption of new rules around the treatments. ", "Florida has also clashed with federal health officials who advocate for providing the treatments for young people.", "Gender-affirming health care for youths has been a target for Republicans in recent years. Last year, the American Medical Association issued a letter urging governors to block any legislation prohibiting the treatment, calling such action “a dangerous intrusion into the practice of medicine.”", " was the first state to enact such a ban on gender affirming care, with Republican lawmakers in 2021 overriding GOP Gov. Asa Hutchinson’s veto of the legislation. ", " Republicans this year approved legislation to outlaw gender-affirming medications for transgender youths. Both laws have been paused amid unfolding legal battles. ", ", a Republican, signed a bill last month that bars federal funds earmarked for the University of Oklahoma Medical Center from being used for gender reassignment treatments for minors. Stitt also called for the Legislature to ban some of those gender reassignment treatments statewide when it returns in February. ", "Top ", " also have vowed to push for strict anti-transgender policies. The state already bans doctors from providing gender-confirming hormone treatment to prepubescent minors. To date, no one has legally challenged the law as medical experts maintain no doctor in Tennessee does so.", "In Florida, DeSantis signed a law last year barring transgender girls and women from playing on public school teams intended for student athletes identified as girls at birth."]}
]